
## Terraform plan for environment: `prep`

**Commit:** 345dca58f83e70ca5dda0d8e6ac2503b09a8e5de


**API version:** release-v5.20.11-rc11
**CLI version:** release-v5.20.11-rc11
**Selfserve version:** release-v5.20.11-rc11
**Internal version:** release-v5.20.11-rc11
**search version:** release-v5.20.11-rc11

### Plan summary

`0 to add, 6 to change, 0 to destroy`

**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_lb_listener_rule.this["selfserve"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_lb_listener_rule.this["selfserve"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "this" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be/fd41ce8376741e70/2de4d12175e447b7"
        tags         = {}
        # (4 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "preview.*",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "ssweb-imperva*",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:15" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.20.11-rc11"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v5.20.11-rc11"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:15"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 15 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:15" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.20.11-rc11"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v5.20.11-rc11"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:15"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 15 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:15" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.20.11-rc11"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v5.20.11-rc11"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:15"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 15 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:15" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.20.11-rc11"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v5.20.11-rc11"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:15"
        name                       = "vol-app-prep-sas-mi-extract"
      ~ revision                   = 15 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-search:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:17",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::146997448015:policy/vol-app-prep-batch-scheduler-inline"
        name             = "vol-app-prep-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-search:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:15",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:15",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:15",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:15",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:17",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:17",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-prep-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

```

</details>